Revit 2026 API

# FailuresAccessorDeleteAllWarnings Method

---

Deletes all FailureMessages of severity "Warning" currently posted in a document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeleteAllWarnings()
```
```vb
Public Sub DeleteAllWarnings
```
```cpp
public:
void DeleteAllWarnings()
```
```fsharp
member DeleteAllWarnings : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

Warnings are deleted immediately and will not be accessible by any further failures processing. Any accessors for these failure messages become invalid.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace